<?php
/**
*
* This file is part of the phpBB Forum Software package.
*
* @copyright (c) phpBB Limited <https://www.phpbb.com>
* @license GNU General Public License, version 2 (GPL-2.0)
*
* For full copyright and license information, please see
* the docs/CREDITS.txt file.
*
*/

/**
* DO NOT CHANGE
*/
if (!defined('IN_PHPBB'))
{
	exit;
}

if (empty($lang) || !is_array($lang))
{
	$lang = array();
}

// DEVELOPERS PLEASE NOTE
//
// All language files should use UTF-8 as their encoding and the files must not contain a BOM.
//
// Placeholders can now contain order information, e.g. instead of
// 'Page %s of %s' you can (and should) write 'Page %1$s of %2$s', this allows
// translators to re-order the output of data while ensuring it remains correct
//
// You do not need this where single placeholders are used, e.g. 'Message %d' is fine
// equally where a string contains only two placeholders which are used to wrap text
// in a url you again do not need to specify an order e.g., 'Click %sHERE%s' is fine

$lang = array_merge($lang, array(
	'ADD_ATTACHMENT'			=> 'Прикачи датотека',
	'ADD_ATTACHMENT_EXPLAIN'	=> 'Доколку сакате да прикачите една или повеќе датотеки, внесете ги деталите подолу.',
	'ADD_FILE'					=> 'Додади ја датотеката',
	'ADD_POLL'					=> 'Создавање анкета',
	'ADD_POLL_EXPLAIN'			=> 'Доколку не сакате да додадете анкета во Вашата тема, оставете ги полињата празни.',
	'ALREADY_DELETED'			=> 'Оваа порака веќе е избришана.',
	'ATTACH_DISK_FULL'			=> 'Нема доволно слободен простор на дискот за да биде прикачена датотеката.',
	'ATTACH_QUOTA_REACHED'		=> 'Се извинуване, но достигнат е максималниот број дозволени прикачени датотеки на овој форум.',
	'ATTACH_SIG'				=> 'Додади потпис (потписите може да се променат преку ККП)',

	'BBCODE_A_HELP'				=> 'Вметнување прикачена датотека во мислењето: [attachment=]filename.ext[/attachment]',
	'BBCODE_B_HELP'				=> 'Задебелен текст: [b]текст[/b]',
	'BBCODE_C_HELP'				=> 'Код: [code]code[/code]',
	'BBCODE_D_HELP'				=> 'Flash: [flash=ширина,висина]http://url[/flash]',
	'BBCODE_F_HELP'				=> 'Големина на фонтот: [size=85]мал текст[/size]',
	'BBCODE_IS_OFF'				=> '%sBBCode%s е <em>ИСКЛУЧЕН</em>',
	'BBCODE_IS_ON'				=> '%sBBCode%s е <em>ВКЛУЧЕН</em>',
	'BBCODE_I_HELP'				=> 'Искосен текст: [i]текст[/i]',
	'BBCODE_L_HELP'				=> 'Список: [list][*]текст[/list]',
	'BBCODE_LISTITEM_HELP'		=> 'Списочен елемент: [*]текст',
	'BBCODE_O_HELP'				=> 'Подреден список: на пример пример [list=1][*]Прв елемент[/list] or [list=a][*]Подточка а[/list]',
	'BBCODE_P_HELP'				=> 'Вметни слика: [img]http://image_url[/img]',
	'BBCODE_Q_HELP'				=> 'Цитиран текст: [quote]текст[/quote]',
	'BBCODE_S_HELP'				=> 'Боја на текст: [color=red]текст[/color] или [color=#FF0000]текст[/color]',
	'BBCODE_U_HELP'				=> 'Подвлечен текст: [u]текст[/u]',
	'BBCODE_W_HELP'				=> 'Вметни линк: [url]http://url[/url] или [url=http://url]URL текст[/url]',
	'BBCODE_Y_HELP'				=> 'Список: додади елемент во списокот',
	'BUMP_ERROR'				=> 'Не можете да ја издигнете темата толку брзо по последното мислење во неа.',

	'CANNOT_DELETE_REPLIED'		=> 'Можете да бришете само мислења кои немаат добиено одговор.',
	'CANNOT_EDIT_POST_LOCKED'	=> 'Ова мислење е заклучено и не можете да го промените.',
	'CANNOT_EDIT_TIME'			=> 'Повеќе не можете да го променувате или избришете мислењето.',
	'CANNOT_POST_ANNOUNCE'		=> 'Не можете да објавувате соопштенија.',
	'CANNOT_POST_STICKY'		=> 'Не можете да објавувате закачени теми.',
	'CHANGE_TOPIC_TO'			=> 'Промени го типот на темата на',
	'CHARS_POST_CONTAINS'		=> array(
		1	=> 'Вашата порака содржи %1$d знак.',
		2	=> 'Вашата порака содржи %1$d знака.',
		3	=> 'Вашата порака содржи %1$d знаци.',
	),
	'CHARS_SIG_CONTAINS'		=> array(
		1	=> 'Вашиот потпис содржи %1$d знак.',
		2	=> 'Вашиот потпис содржи %1$d знака.',
		3	=> 'Вашиот потпис содржи %1$d знаци.',
	),
	'CLOSE_TAGS'				=> 'Затвори ги таговите',
	'CURRENT_TOPIC'				=> 'Тековна тема',

	'DELETE_FILE'				=> 'Избриши ја датотеката',
	'DELETE_MESSAGE'			=> 'Избриши ја пораката',
	'DELETE_MESSAGE_CONFIRM'	=> 'Сигурни ли сте дека сакате да ја избришете пораката?',
	'DELETE_OWN_POSTS'			=> 'Можете да ги бришете само сопствените мислења.',
	'DELETE_PERMANENTLY'		=> 'Избриши засекогаш',
	'DELETE_POST_CONFIRM'		=> 'Сигурни ли сте дека сакате да го избришете мислењето?',
	'DELETE_POST_PERMANENTLY_CONFIRM'	=> 'Сигурни ли сте дека сакате да го избришете мислењето <strong>засекогаш</strong>?',
	'DELETE_POST_PERMANENTLY'	=> array(
		1	=> 'Избриши го мислењето засекогаш за да не може да биде повратено',
		2	=> 'Избриши ги засекогаш овие %1$d мислења за да не може да бидат повратени',
		3	=> 'Избриши фи засекогаш овие %1$d мислења за да не може да бидат повратени',
	),
	'DELETE_POSTS_CONFIRM'		=> 'Сигурни ли сте дека сакате да ги избришете мислењата?',
	'DELETE_POSTS_PERMANENTLY_CONFIRM'	=> 'Сигурни ли сте дека сакате да ги избришете мислењата <strong>засекогаш</strong>?',
	'DELETE_REASON'				=> 'Причина за бришење',
	'DELETE_REASON_EXPLAIN'		=> 'Внесената причина ќе биде видливе за модераторите.',
	'DELETE_POST_WARN'			=> 'Избриши го мислењето',
	'DELETE_TOPIC_CONFIRM'		=> 'Сигурни ли сте дека сакате да ја избришете темата?',
	'DELETE_TOPIC_PERMANENTLY'	=> array(
		1	=> 'Избриши ја темата засекогаш за да не може да биде повратена',
		2	=> 'Избриши ги засекогаш овие %1$d теми за да не може да бидат повратени',
		3	=> 'Избриши ги засекогаш овие %1$d теми за да не може да бидат повратени',
	),
	'DELETE_TOPIC_PERMANENTLY_CONFIRM'	=> 'Сигурни ли сте дека сакате да ја избришете темата <strong>засекогаш</strong>?',
	'DELETE_TOPICS_CONFIRM'		=> 'Сигурни ли сте дека сакате да ги избришете темите?',
	'DELETE_TOPICS_PERMANENTLY_CONFIRM'	=> 'Сигурни ли сте дека сакате да ги избришете темите <strong>засекогаш</strong>?',
	'DISABLE_BBCODE'			=> 'Исклучи BBCode',
	'DISABLE_MAGIC_URL'			=> 'Не преобразувај URL адреси автоматски',
	'DISABLE_SMILIES'			=> 'Исклучи емотикони',
	'DISALLOWED_CONTENT'		=> 'Прикачувањето беше одбиено бидејќи прикачената датотека беше идентификувана како потенцијален вектор на напади.',
	'DISALLOWED_EXTENSION'		=> 'Наставката %s не е дозволена.',
	'DRAFT_LOADED'				=> 'Недовршеното мислење е додадено во полето за пишување и истото ќе биде избришано по објавувањето на мислењето.',
	'DRAFT_LOADED_PM'			=> 'Недовршеното мислење е додадено во полето за пишување и истото ќе биде избришано по испраќањето на пораката.',
	'DRAFT_SAVED'				=> 'Недовршеното мислење е успешно зачувано.',
	'DRAFT_TITLE'				=> 'Наслов на недовршеното мислење',

	'EDIT_REASON'				=> 'Причина за промена на мислењето',
	'EMPTY_FILEUPLOAD'			=> 'Прикачената датотека е празна.',
	'EMPTY_MESSAGE'				=> 'Мора да внесете текст во објавата.',
	'EMPTY_REMOTE_DATA'			=> 'Датотеката не можеше да биде прикачена, Ве молиме обидете се да ја прикачите рачно.',

	'FLASH_IS_OFF'				=> '[flash] е ИСКЛУЧЕН',
	'FLASH_IS_ON'				=> '[flash] е ВКЛУЧЕН',
	'FLOOD_ERROR'				=> 'Не можете да објавите ново мислење толку брзо по последното.',
	'FONT_COLOR'				=> 'Боја на текстот',
	'FONT_COLOR_HIDE'			=> 'Скриј ја бојата на текстот',
	'FONT_HUGE'					=> 'Огромен',
	'FONT_LARGE'				=> 'Голем',
	'FONT_NORMAL'				=> 'Нормален',
	'FONT_SIZE'					=> 'Големина на фонт',
	'FONT_SMALL'				=> 'Мал',
	'FONT_TINY'					=> 'Минијатурен',

	'GENERAL_UPLOAD_ERROR'		=> 'Неуспешно прикачување на датотека во %s.',

	'IMAGES_ARE_OFF'			=> '[img] е ИСКЛУЧЕН',
	'IMAGES_ARE_ON'				=> '[img] е ВКЛУЧЕН',
	'INVALID_FILENAME'			=> '%s е невалидно име на датотека.',

	'LOAD'						=> 'Вчитај',
	'LOAD_DRAFT'				=> 'Вчитај недовршено мислење',
	'LOAD_DRAFT_EXPLAIN'		=> 'Тука можете да го изберете недовршеното мислење кое сакате да продолжите да го пишувате. Вашата тековна објава ќе биде откажана и нејзината содржина ќе биде избришана. Можете да прегледувате, променувате и бришете недовршени мислења во Корисничкиот Контролен Панел.',
	'LOGIN_EXPLAIN_BUMP'		=> 'Мора да се најавите за да можете да издигнувате теми во овој форум.',
	'LOGIN_EXPLAIN_DELETE'		=> 'Мора да се најавите за да можете да бришете мислења во овој форум.',
	'LOGIN_EXPLAIN_POST'		=> 'Мора да се најавите за да можете да објавувате во овој форум.',
	'LOGIN_EXPLAIN_QUOTE'		=> 'Мора да се најавите за да можете да цитирате мислења во овој форум.',
	'LOGIN_EXPLAIN_REPLY'		=> 'Мора да се најавите за да можете да одговарате на теми во овој форум.',

	'MAX_FONT_SIZE_EXCEEDED'	=> 'Можете да користите фонтови со големина до %d.',
	'MAX_FLASH_HEIGHT_EXCEEDED'	=> array(
		1	=> 'Вашите flash датотеки не може да бидат повисоки од %d пиксел.',
		2	=> 'Вашите flash датотеки не може да бидат повисоки од %d пиксела.',
		3	=> 'Вашите flash датотеки не може да бидат повисоки од %d пиксели.',
	),
	'MAX_FLASH_WIDTH_EXCEEDED'	=> array(
		1	=> 'Вашите flash датотеки не може да бидат пошироки од %d пиксел.',
		2	=> 'Вашите flash датотеки не може да бидат пошироки од %d пиксела.',
		3	=> 'Вашите flash датотеки не може да бидат пошироки од %d пиксели.',
	),
	'MAX_IMG_HEIGHT_EXCEEDED'	=> array(
		1	=> 'Вашите слики не може да бидат повисоки од %d пиксел.',
		2	=> 'Вашите слики не може да бидат повисоки од %d пиксела.',
		3	=> 'Вашите слики не може да бидат повисоки од %d пиксели.',
	),
	'MAX_IMG_WIDTH_EXCEEDED'	=> array(
		1	=> 'Вашите слики не може да бидат пошироки од %d пиксел.',
		2	=> 'Вашите слики не може да бидат пошироки од %d пиксела.',
		3	=> 'Вашите слики не може да бидат пошироки од %d пиксели.',
	),

	'MESSAGE_BODY_EXPLAIN'		=> array(
		0	=> '', // zero means no limit, so we don't view a message here.
		1	=> 'Внесете ја Вашата порака овде. Пораката не може да содржи повеќе од <strong>%d</strong> знак.',
		2	=> 'Внесете ја Вашата порака овде. Пораката не може да содржи повеќе од <strong>%d</strong> знака.',
		3	=> 'Внесете ја Вашата порака овде. Пораката не може да содржи повеќе од <strong>%d</strong> знаци.',
	),
	'MESSAGE_DELETED'			=> 'Пораката е успешно избришана.',
	'MORE_SMILIES'				=> 'Прикажи повеќе емотикони',

	'NOTIFY_REPLY'				=> 'Известувај ме за нови одговори',
	'NOT_UPLOADED'				=> 'Датотеката не можеше да биде прикачена.',
	'NO_DELETE_POLL_OPTIONS'	=> 'Не можете да ги избришете постоечките опции во анкетата.',
	'NO_PM_ICON'				=> 'Нема икона',
	'NO_POLL_TITLE'				=> 'Мора да наведете наслов на анкетата.',
	'NO_POST'					=> 'Бараното мислење не постои.',
	'NO_POST_MODE'				=> 'Не е избран режим за објавување.',
	'NO_TEMP_DIR'				=> 'Привремената папка не може да биде пронајдена или не е достапна за запишување.',

	'PARTIAL_UPLOAD'			=> 'Датотеката беше само делумно прикачена.',
	'PHP_UPLOAD_STOPPED'		=> 'Некој PHP додаток го запра прикачувњето на датотеката.',
	'PHP_SIZE_NA'				=> 'Прикачената датотека е преголема.<br />Максималната дозволена големина поставена во php.ini не може да биде одредена.',
	'PHP_SIZE_OVERRUN'			=> 'Прикачената датотека е преголема. Максималната дозволена големина е %1$d %2$s.<br />Имајте во предвид дека ова е поставено во php.ini и не може да биде преовладано.',
	'PLACE_INLINE'				=> 'Вметни во текстот',
	'POLL_DELETE'				=> 'Избриши ја анкетата',
	'POLL_FOR'					=> 'Анкетата да биде активна',
	'POLL_FOR_EXPLAIN'			=> 'Внесете 0 за анкета без крај.',
	'POLL_MAX_OPTIONS'			=> 'Број на опции по корисник',
	'POLL_MAX_OPTIONS_EXPLAIN'	=> 'Ова е бројот на опции кои секој корисник може да ги избере при гласањето.',
	'POLL_OPTIONS'				=> 'Опции на анкетата',
	'POLL_OPTIONS_EXPLAIN'		=> array(
		1	=> 'Вметнете ја секоја опција на нов ред. Можете да внесете само <strong>%d</strong> опција.',
		2	=> 'Вметнете ја секоја опција на нов ред. Можете да внесете најмногу <strong>%d</strong> опции.',
		3	=> 'Вметнете ја секоја опција на нов ред. Можете да внесете најмногу <strong>%d</strong> опции.',
	),
	'POLL_OPTIONS_EDIT_EXPLAIN'		=> array(
		1	=> 'Вметнете ја секоја опција на нов ред. Можете да внесете само <strong>%d</strong> опција. Доколку отстраните или додадете опција, сите претходни гласови ќе бидат ресетирани.',
		2	=> 'Вметнете ја секоја опција на нов ред. Можете да внесете најмногу <strong>%d</strong> опции. Доколку отстраните или додадете опција, сите претходни гласови ќе бидат ресетирани.',
		3	=> 'Вметнете ја секоја опција на нов ред. Можете да внесете најмногу <strong>%d</strong> опции. Доколку отстраните или додадете опција, сите претходни гласови ќе бидат ресетирани.',
	),
	'POLL_QUESTION'				=> 'Анкетно прашање',
	'POLL_TITLE_TOO_LONG'		=> 'Наслово на анкетата не може да содржи над 100 знаци.',
	'POLL_TITLE_COMP_TOO_LONG'	=> 'Анализираната големина на Вашата анкета е преголема. Размислете за отстранување BBCodes или емотикони.',
	'POLL_VOTE_CHANGE'			=> 'Дозволи прегласување',
	'POLL_VOTE_CHANGE_EXPLAIN'	=> 'Доколку е вклучено, корисниците ќе може да ги променуваат своите гласови.',
	'POSTED_ATTACHMENTS'		=> 'Прикачени датотеки',
	'POST_APPROVAL_NOTIFY'		=> 'Ќе бидете известени кога Вашето мислење ќе биде одобрено.',
	'POST_CONFIRMATION'			=> 'Потврда за објава',
	'POST_CONFIRM_EXPLAIN'		=> 'Со цел да спречиме автоматски објавувања, форумот бара да внесете код за потврда. Кодот е прикажан на сликата која би требало да ја видите подоле. Ако поради оштетување на видот или некоја друга причина не можете да го прочитате кодот, Ве молиме контактирајте со %sадминистраторот на форумот%s.',
	'POST_DELETED'				=> 'Мислењето е успешно избришано.',
	'POST_EDITED'				=> 'Мислењето е успешно променето.',
	'POST_EDITED_MOD'			=> 'Мислењето е успешно променето, но треба да биде одобрено од модератор пред да биде достапно за јавноста.',
	'POST_GLOBAL'				=> 'Глобално соопштение',
	'POST_ICON'					=> 'Икона',
	'POST_NORMAL'				=> 'Нормално',
	'POST_REVIEW'				=> 'Преглед на мислењето',
	'POST_REVIEW_EDIT'			=> 'Преглед на мислењето',
	'POST_REVIEW_EDIT_EXPLAIN'	=> 'Мислењето е променето од друг корисник додека вие го менувавте. Можеби ќе сакате да ја прегледате моменталната верзија на мислењето и да ги прилагодите Вашите промени.',
	'POST_REVIEW_EXPLAIN'		=> 'Најмалку едно ново мислење е објавено во темата. Можеби ќе сакате да го прегледате Вашето мислење како резултат на ова.',
	'POST_STORED'				=> 'Мислењето е успешно објавено.',
	'POST_STORED_MOD'			=> 'Мислењето е успешно објавено, но треба да биде одобрено од модератор пред да биде достапно за јавноста.',
	'POST_TOPIC_AS'				=> 'Објави ја темата како',
	'PROGRESS_BAR'				=> 'Прогрес',

	'QUOTE_DEPTH_EXCEEDED'		=> array(
		1	=> 'Можете да вметнете само %d цитат еден во друг.',
		2	=> 'Можете да вметнете само %d цитата еден во друг.',
		3	=> 'Можете да вметнете само %d цитати еден во друг.',
	),
	'QUOTE_NO_NESTING'			=> 'Не можете да вметнувате цитат еден во друг.',

	'REMOTE_UPLOAD_TIMEOUT'		=> 'Избраната датотека не можеше да биде прикачена бидејќи времето на барањето истече.',
	'SAVE'						=> 'Зачувај',
	'SAVE_DATE'					=> 'Зачувај на',
	'SAVE_DRAFT'				=> 'Зачувај недовршено мислење',
	'SAVE_DRAFT_CONFIRM'		=> 'Имајте предвид дека зачуваните недовршени мислења го содржат само насловот и пораката, додека сите други елементи ќе бидат отстранети. Дали сакате да го зачувате недовршеното мислење?',
	'SMILIES'					=> 'Емотикони',
	'SMILIES_ARE_OFF'			=> 'Емотиконите се ИСКЛУЧЕНИ',
	'SMILIES_ARE_ON'			=> 'Емотиконите се ВКЛУЧЕНИ',
	'STICKY_ANNOUNCE_TIME_LIMIT'=> 'Времетраење на закачена тема/соопштение/глобално соопштение',
	'STICK_TOPIC_FOR'			=> 'Закачи ја темата за',
	'STICK_TOPIC_FOR_EXPLAIN'	=> 'Внесете 0 за бескрајна закачена тема/соопштение/глобално соопштение. Имајте во предвид дека бројот е во релација со датата на мислењето.',
	'STYLES_TIP'				=> 'Совет: стиловите може да бидат брзо применети на селектираниот текст.',

	'TOO_FEW_CHARS'				=> 'Вашата порака содржи премалку знаци.',
	'TOO_FEW_CHARS_LIMIT'		=> array(
		1	=> 'Мора да внесете најмалку %1$d знак.',
		2	=> 'Мора да внесете најмалку %1$d знака.',
		3	=> 'Мора да внесете најмалку %1$d знаци.',
	),
	'TOO_FEW_POLL_OPTIONS'		=> 'Мора да внесете најмалку две опции за анкетата.',
	'TOO_MANY_ATTACHMENTS'		=> 'Датотеката не може да биде додадена, бидејќи %d е максималниот дозволен број.',
	'TOO_MANY_CHARS'			=> 'Вашата порака содржи премногу знаци.',
	'TOO_MANY_CHARS_LIMIT'		=> array(
		1	=> 'Максималниот дозволен број на знаци е %1$d.',
		2	=> 'Максималниот дозволен број на знаци е %1$d.',
		3	=> 'Максималниот дозволен број на знаци е %1$d.',
	),
	'TOO_MANY_POLL_OPTIONS'		=> 'Се обидовте да внесете премногу опции за анкетата.',
	'TOO_MANY_SMILIES'			=> 'Вашата порака содржи премногу емотикони. Максималниот дозволен број е %d.',
	'TOO_MANY_URLS'				=> 'Вашата порака содржи премногу URL адреси. Максималниот дозволен број е %d.',
	'TOO_MANY_USER_OPTIONS'		=> 'Не можете да дозволите повеќе опции по корисник од бројот на опции во анкетата.',
	'TOPIC_BUMPED'				=> 'Темата е успешно издигната.',

	'UNAUTHORISED_BBCODE'		=> 'Не можете да користите одредени BBCodes: %s.',
	'UNGLOBALISE_EXPLAIN'		=> 'За да ја промените темата од глобална во нормална, потребно е да изберете форум во кој истата ќе биде прикажана.',
	'UNSUPPORTED_CHARACTERS_MESSAGE'	=> 'Вашата порака ги содржи следниве неподдржани знаци:<br />%s',
	'UNSUPPORTED_CHARACTERS_SUBJECT'	=> 'Вашиот наслов ги содржи следниве неподдржани знаци:<br />%s',
	'UPDATE_COMMENT'			=> 'Ажуријрај го коментарот',
	'URL_INVALID'				=> 'Внесената URL адреса е невалидна.',
	'URL_NOT_FOUND'				=> 'Избраната датотека не може да биде пронајдена.',
	'URL_IS_OFF'				=> '[url] е ИСКЛУЧЕН',
	'URL_IS_ON'					=> '[url] е ВКЛУЧЕН',
	'USER_CANNOT_BUMP'			=> 'Не можете да издигнувате теми во овој форум.',
	'USER_CANNOT_DELETE'		=> 'Не можете да бришете мислења во овој форум.',
	'USER_CANNOT_EDIT'			=> 'Не можете да променувате мислења во овој форум.',
	'USER_CANNOT_REPLY'			=> 'Не можете да одговарате во овој форум.',
	'USER_CANNOT_FORUM_POST'	=> 'Не можете да вршите операции поврзани со објавување во овој форум, бидејќи типот на форумот не го поддржува тоа.',

	'VIEW_MESSAGE'				=> '%sВиди го објавеното мислење%s',
	'VIEW_PRIVATE_MESSAGE'		=> '%sВиди ја испратената приватна порака%s',

	'WRONG_FILESIZE'			=> 'Датотеката е премногу голема. Максималната дозволена големина е %1$d %2$s.',
	'WRONG_SIZE'				=> 'Сликата мора да биде најмалку %1$s широка, %2$s висока и најмногу %3$s широка и %4$s висока. Поднесената слика е %5$s широка и %6$s висока.',
));
